; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_10)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - person
	)

  (:init
		(= (x b0) 10)
(= (y b0) 0)
(= (x b1) 1)
(= (y b1) 0)
(= (x b2) 0)
(= (y b2) 0)
(= (x b3) -9)
(= (y b3) 0)
(= (x b4) -2)
(= (y b4) 0)
(= (x b5) -10)
(= (y b5) 0)
(= (x b6) -6)
(= (y b6) 0)
(= (x b7) 4)
(= (y b7) 0)
(= (x b8) 0)
(= (y b8) 0)
(= (x b9) 4)
(= (y b9) 0)
(= (x b10) 10)
(= (y b10) 0)
(= (x b11) -6)
(= (y b11) 0)
(= (x b12) 0)
(= (y b12) 0)

		(= (d p0) 78)
(= (d p1) 45)
(= (d p2) 58)
(= (d p3) 27)
(= (d p4) 12)
(= (d p5) 93)
(= (d p6) 34)
(= (d p7) 77)
(= (d p8) 20)
(= (d p9) 18)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
		)
	)
)

; plan
1. (go_est b12)
   changed: (x b12) from 0 to 3
   goals met: 0 of 10
2. (go_est b8)
   changed: (x b8) from 0 to 3
   goals met: 0 of 10
3. (go_north_east b2)
   changed: (x b2) from 0 to 1.5, (y b2) from 0 to 1.5
   goals met: 0 of 10
4. (go_north_east b2)
   changed: (x b2) from 1.5 to 3, (y b2) from 1.5 to 3
   goals met: 0 of 10
5. (go_north_east b2)
   changed: (x b2) from 3 to 4.5, (y b2) from 3 to 4.5
   goals met: 0 of 10
6. (go_north_east b2)
   changed: (x b2) from 4.5 to 6, (y b2) from 4.5 to 6
   goals met: 0 of 10
7. (go_north_east b2)
   changed: (x b2) from 6 to 7.5, (y b2) from 6 to 7.5
   goals met: 0 of 10
8. (go_north_east b2)
   changed: (x b2) from 7.5 to 9, (y b2) from 7.5 to 9
   goals met: 0 of 10
9. (go_north_west b2)
   changed: (x b2) from 9 to 7.5, (y b2) from 9 to 10.5
   goals met: 0 of 10
10. (go_north_west b2)
   changed: (x b2) from 7.5 to 6, (y b2) from 10.5 to 12
   goals met: 0 of 10
11. (go_north_west b2)
   changed: (x b2) from 6 to 4.5, (y b2) from 12 to 13.5
   goals met: 0 of 10
12. (go_north_west b2)
   changed: (x b2) from 4.5 to 3, (y b2) from 13.5 to 15
   goals met: 0 of 10
13. (save_person b2 p4)
   added: (saved p4)
   goals met: 1 of 10
14. (go_north_west b2)
   changed: (x b2) from 3 to 1.5, (y b2) from 15 to 16.5
   goals met: 1 of 10
15. (go_north_west b2)
   changed: (x b2) from 1.5 to 0, (y b2) from 16.5 to 18
   goals met: 1 of 10
16. (save_person b2 p9)
   added: (saved p9)
   goals met: 2 of 10
17. (go_north_west b2)
   changed: (x b2) from 0 to -1.5, (y b2) from 18 to 19.5
   goals met: 2 of 10
18. (go_north_west b2)
   changed: (x b2) from -1.5 to -3, (y b2) from 19.5 to 21
   goals met: 2 of 10
19. (go_north_west b2)
   changed: (x b2) from -3 to -4.5, (y b2) from 21 to 22.5
   goals met: 2 of 10
20. (go_north_west b2)
   changed: (x b2) from -4.5 to -6, (y b2) from 22.5 to 24
   goals met: 2 of 10
21. (go_north_west b2)
   changed: (x b2) from -6 to -7.5, (y b2) from 24 to 25.5
   goals met: 2 of 10
22. (go_north_west b2)
   changed: (x b2) from -7.5 to -9, (y b2) from 25.5 to 27
   goals met: 2 of 10
23. (go_north_west b2)
   changed: (x b2) from -9 to -10.5, (y b2) from 27 to 28.5
   goals met: 2 of 10
24. (go_north_west b2)
   changed: (x b2) from -10.5 to -12, (y b2) from 28.5 to 30
   goals met: 2 of 10
25. (go_north_west b2)
   changed: (x b2) from -12 to -13.5, (y b2) from 30 to 31.5
   goals met: 2 of 10
26. (go_north_east b2)
   changed: (x b2) from -13.5 to -12, (y b2) from 31.5 to 33
   goals met: 2 of 10
27. (go_north_east b2)
   changed: (x b2) from -12 to -10.5, (y b2) from 33 to 34.5
   goals met: 2 of 10
28. (go_north_east b2)
   changed: (x b2) from -10.5 to -9, (y b2) from 34.5 to 36
   goals met: 2 of 10
29. (go_north_east b2)
   changed: (x b2) from -9 to -7.5, (y b2) from 36 to 37.5
   goals met: 2 of 10
30. (go_north_east b2)
   changed: (x b2) from -7.5 to -6, (y b2) from 37.5 to 39
   goals met: 2 of 10
31. (go_north_east b2)
   changed: (x b2) from -6 to -4.5, (y b2) from 39 to 40.5
   goals met: 2 of 10
32. (go_north_east b2)
   changed: (x b2) from -4.5 to -3, (y b2) from 40.5 to 42
   goals met: 2 of 10
33. (go_north_east b2)
   changed: (x b2) from -3 to -1.5, (y b2) from 42 to 43.5
   goals met: 2 of 10
34. (go_north_east b2)
   changed: (x b2) from -1.5 to 0, (y b2) from 43.5 to 45
   goals met: 2 of 10
35. (save_person b2 p3)
   added: (saved p3)
   goals met: 3 of 10
36. (save_person b2 p6)
   added: (saved p6)
   goals met: 4 of 10
37. (save_person b2 p8)
   added: (saved p8)
   goals met: 5 of 10
38. (go_north_east b2)
   changed: (x b2) from 0 to 1.5, (y b2) from 45 to 46.5
   goals met: 5 of 10
39. (go_north_east b2)
   changed: (x b2) from 1.5 to 3, (y b2) from 46.5 to 48
   goals met: 5 of 10
40. (go_north_east b2)
   changed: (x b2) from 3 to 4.5, (y b2) from 48 to 49.5
   goals met: 5 of 10
41. (go_north_east b2)
   changed: (x b2) from 4.5 to 6, (y b2) from 49.5 to 51
   goals met: 5 of 10
42. (go_north_east b2)
   changed: (x b2) from 6 to 7.5, (y b2) from 51 to 52.5
   goals met: 5 of 10
43. (go_north_east b2)
   changed: (x b2) from 7.5 to 9, (y b2) from 52.5 to 54
   goals met: 5 of 10
44. (go_north_east b2)
   changed: (x b2) from 9 to 10.5, (y b2) from 54 to 55.5
   goals met: 5 of 10
45. (go_north_east b2)
   changed: (x b2) from 10.5 to 12, (y b2) from 55.5 to 57
   goals met: 5 of 10
46. (go_north_east b2)
   changed: (x b2) from 12 to 13.5, (y b2) from 57 to 58.5
   goals met: 5 of 10
47. (go_north_east b2)
   changed: (x b2) from 13.5 to 15, (y b2) from 58.5 to 60
   goals met: 5 of 10
48. (go_north_east b2)
   changed: (x b2) from 15 to 16.5, (y b2) from 60 to 61.5
   goals met: 5 of 10
49. (go_west b2)
   changed: (x b2) from 16.5 to 13.5
   goals met: 5 of 10
50. (go_west b2)
   changed: (x b2) from 13.5 to 10.5
   goals met: 5 of 10
51. (go_west b2)
   changed: (x b2) from 10.5 to 7.5
   goals met: 5 of 10
52. (go_west b2)
   changed: (x b2) from 7.5 to 4.5
   goals met: 5 of 10
53. (go_west b2)
   changed: (x b2) from 4.5 to 1.5
   goals met: 5 of 10
54. (go_north_east b2)
   changed: (x b2) from 1.5 to 3, (y b2) from 61.5 to 63
   goals met: 5 of 10
55. (go_north_east b2)
   changed: (x b2) from 3 to 4.5, (y b2) from 63 to 64.5
   goals met: 5 of 10
56. (go_north_east b2)
   changed: (x b2) from 4.5 to 6, (y b2) from 64.5 to 66
   goals met: 5 of 10
57. (go_north_east b2)
   changed: (x b2) from 6 to 7.5, (y b2) from 66 to 67.5
   goals met: 5 of 10
58. (go_north_east b2)
   changed: (x b2) from 7.5 to 9, (y b2) from 67.5 to 69
   goals met: 5 of 10
59. (save_person b2 p2)
   added: (saved p2)
   goals met: 6 of 10
60. (go_north_west b2)
   changed: (x b2) from 9 to 7.5, (y b2) from 69 to 70.5
   goals met: 6 of 10
61. (go_north_west b2)
   changed: (x b2) from 7.5 to 6, (y b2) from 70.5 to 72
   goals met: 6 of 10
62. (go_north_west b2)
   changed: (x b2) from 6 to 4.5, (y b2) from 72 to 73.5
   goals met: 6 of 10
63. (go_north_east b2)
   changed: (x b2) from 4.5 to 6, (y b2) from 73.5 to 75
   goals met: 6 of 10
64. (go_north_east b2)
   changed: (x b2) from 6 to 7.5, (y b2) from 75 to 76.5
   goals met: 6 of 10
65. (go_north_east b2)
   changed: (x b2) from 7.5 to 9, (y b2) from 76.5 to 78
   goals met: 6 of 10
66. (go_north_east b2)
   changed: (x b2) from 9 to 10.5, (y b2) from 78 to 79.5
   goals met: 6 of 10
67. (go_north_east b2)
   changed: (x b2) from 10.5 to 12, (y b2) from 79.5 to 81
   goals met: 6 of 10
68. (go_west b2)
   changed: (x b2) from 12 to 9
   goals met: 6 of 10
69. (go_west b2)
   changed: (x b2) from 9 to 6
   goals met: 6 of 10
70. (go_west b2)
   changed: (x b2) from 6 to 3
   goals met: 6 of 10
71. (save_person b2 p7)
   added: (saved p7)
   goals met: 7 of 10
72. (save_person b2 p0)
   added: (saved p0)
   goals met: 8 of 10
73. (go_north_east b2)
   changed: (x b2) from 3 to 4.5, (y b2) from 81 to 82.5
   goals met: 8 of 10
74. (go_north_east b2)
   changed: (x b2) from 4.5 to 6, (y b2) from 82.5 to 84
   goals met: 8 of 10
75. (go_north_east b2)
   changed: (x b2) from 6 to 7.5, (y b2) from 84 to 85.5
   goals met: 8 of 10
76. (go_north_west b2)
   changed: (x b2) from 7.5 to 6, (y b2) from 85.5 to 87
   goals met: 8 of 10
77. (go_west b2)
   changed: (x b2) from 6 to 3
   goals met: 8 of 10
78. (go_west b2)
   changed: (x b2) from 3 to 0
   goals met: 8 of 10
79. (go_west b2)
   changed: (x b2) from 0 to -3
   goals met: 8 of 10
80. (go_west b2)
   changed: (x b2) from -3 to -6
   goals met: 8 of 10
81. (go_north_east b2)
   changed: (x b2) from -6 to -4.5, (y b2) from 87 to 88.5
   goals met: 8 of 10
82. (go_north_east b2)
   changed: (x b2) from -4.5 to -3, (y b2) from 88.5 to 90
   goals met: 8 of 10
83. (go_north_east b2)
   changed: (x b2) from -3 to -1.5, (y b2) from 90 to 91.5
   goals met: 8 of 10
84. (go_north_east b2)
   changed: (x b2) from -1.5 to 0, (y b2) from 91.5 to 93
   goals met: 8 of 10
85. (save_person b2 p5)
   added: (saved p5)
   goals met: 9 of 10
86. (go_south_east b2)
   changed: (x b2) from 0 to -2, (y b2) from 93 to 91
   goals met: 9 of 10
87. (go_south_east b2)
   changed: (x b2) from -2 to -4, (y b2) from 91 to 89
   goals met: 9 of 10
88. (go_south_east b2)
   changed: (x b2) from -4 to -6, (y b2) from 89 to 87
   goals met: 9 of 10
89. (go_south_east b2)
   changed: (x b2) from -6 to -8, (y b2) from 87 to 85
   goals met: 9 of 10
90. (go_south_east b2)
   changed: (x b2) from -8 to -10, (y b2) from 85 to 83
   goals met: 9 of 10
91. (go_south_east b2)
   changed: (x b2) from -10 to -12, (y b2) from 83 to 81
   goals met: 9 of 10
92. (go_south_west b2)
   changed: (x b2) from -12 to -10, (y b2) from 81 to 79
   goals met: 9 of 10
93. (go_south_west b2)
   changed: (x b2) from -10 to -8, (y b2) from 79 to 77
   goals met: 9 of 10
94. (go_south_west b2)
   changed: (x b2) from -8 to -6, (y b2) from 77 to 75
   goals met: 9 of 10
95. (go_south_west b2)
   changed: (x b2) from -6 to -4, (y b2) from 75 to 73
   goals met: 9 of 10
96. (go_south_west b2)
   changed: (x b2) from -4 to -2, (y b2) from 73 to 71
   goals met: 9 of 10
97. (go_south_west b2)
   changed: (x b2) from -2 to 0, (y b2) from 71 to 69
   goals met: 9 of 10
98. (save_person b2 p1)
   added: (saved p1)
   goals met: 10 of 10
